In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Age':[16,20], 'Income':[1000,2000]})
df2 = pd.DataFrame({'Age':[25,27], 'Income':[1500,2500]})

In [3]:
df1

   Age  Income
0   16    1000
1   20    2000

In [4]:
df2

   Age  Income
0   25    1500
1   27    2500